content/posts.org
#+TITLE: Posts
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

* APC
:PROPERTIES:
:EXPORT_HUGO_SECTION: /
:EXPORT_FILE_NAME: apc
:EXPORT_DATE: 2021-02-03T20:52:46-0300
:END:

=TODO: Colocar informações de APC aqui=
** Livros
+ [Inglês] [[https://greenteapress.com/wp/think-python-2e/][Think Python 2e]]

  #+begin_quote
  Esse é o livro referência para o curso de APC do semestre 2020/02
  #+end_quote

+ [Inglês] [[https://automatetheboringstuff.com/][Automate the Boring Stuff with Python]]

  #+begin_quote
  Esse livro ensina o básico de Python de uma forma descontraída, com exemplos
  práticos, de fácil leitura.
  #+end_quote

+ [Inglês] [[https://cs50.harvard.edu][CS50 - Harvard]]

  #+begin_quote
  Curso de introdução a computação de Harvard, cobre bastante do conteúdo
  abordado em APC, apenas diferindo na linguagem base (A primeira linguagem
  ensinada no CS50 é =C=, depois progredindo para =Python=, =SQL= e
  =JavaScript=)

  A ideia do CS50, assim como em APC, é ensinar como
  programar. Como funcionam repetições? iterações? lógica booleana? etc...
  Portanto, a linguagem não faz uma diferença tão grande.
  #+end_quote
