content/apc.md
+++
title = "APC"
author = ["Cardosaum"]
date = 2021-02-03T00:00:00-03:00
lastmod = 2021-02-03T22:16:55-03:00
draft = false
weight = 1003
+++

`TODO: Colocar informações de APC aqui`


## Livros {#livros}

-   [Inglês] [Think Python 2e](https://greenteapress.com/wp/think-python-2e/)

    > Esse é o livro referência para o curso de APC do semestre 2020/02

-   [Inglês] [Automate the Boring Stuff with Python](https://automatetheboringstuff.com/)

    > Esse livro ensina o básico de Python de uma forma descontraída, com exemplos
    > práticos, de fácil leitura.

-   [Inglês] [CS50 - Harvard](https://cs50.harvard.edu)

    > Curso de introdução a computação de Harvard, cobre bastante do conteúdo
    > abordado em APC, apenas diferindo na linguagem base (A primeira linguagem
    > ensinada no CS50 é `C`, depois progredindo para `Python`, `SQL` e
    > `JavaScript`)
    >
    > A ideia do CS50, assim como em APC, é ensinar como
    > programar. Como funcionam repetições? iterações? lógica booleana? etc...
    > Portanto, a linguagem não faz uma diferença tão grande.
